---
kind: type
id: T:Autodesk.Revit.DB.ExternalFileReferenceType
source: html/4ccfe92f-71d9-e9d6-c308-5a178186837b.htm
---
# Autodesk.Revit.DB.ExternalFileReferenceType

Enum class indicating kinds of external file references

## Syntax (C#)
```csharp
public enum ExternalFileReferenceType
```